DataProcessors/Renault_ПолучениеДанныхИзBVM_WS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_ПолучениеДанныхИзBVM_WS</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбщаяТаблица</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаПоказателей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Критерий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеКритерия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаОпций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодКритерия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеКритерия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Критерий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Renault_АвтомобилиДопРеквизиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_АвтомобилиДопРеквизиты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СемействоАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СемействаАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СалонныйФильтр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГУР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AC</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоПринятоНаСклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗамечаниеПриемки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПриемкиНаСклад</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодМоделиДвигателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндексМоделиДвигателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодМоделиКПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндексМоделиКПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодТипаКузова</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Фаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ФазыМоделей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Продавец</Name>
					<Comment>Дилерский центр, который продал авто</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДвигателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТоплива</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ABS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПривода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ПриводАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегионЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Регионы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаОСАГО</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияОСАГО</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаКАСКО</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияКАСКО</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодКлиматическойУстановки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_КритерииАвтомобиля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_КритерииАвтомобиля</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОписаниеКритерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеЗначенияКритерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодКритерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Renault_ПриводАвтомобиля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_ПриводАвтомобиля</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Полный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Передний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задний</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Renault_ФазыМоделей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_ФазыМоделей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фаза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/Renault_ПолучениеДанныхИзBVM_WS/Ext/ObjectModule.bsl
Функция ПолучениеДанныхИзBVM(VIN) Экспорт
	
	Результат = Renault_АвтосервисСерверПовтИспользования.ПолучитьДанныеBVM(VIN);
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда 
		
		Сообщить("По автомобилю с VIN: " + VIN + " информация не найдена.");
		Возврат Ложь;
		
	КонецЕсли;
	
	ОбщаяТаблица.Очистить();
	ТаблицаПоказателей.Очистить();
	ТаблицаОпций.Очистить();
	
	СС = Новый Соответствие;
	СС.Вставить("tapv","1000TAPV"); 
	СС.Вставить("tvv","1000TVV");
	СС.Вставить("version","1000VVER");
	СС.Вставить("NFab","1000MNUM");
	СС.Вставить("refMot","1000ENNOM");
	СС.Вставить("refBoi","1000BOTNOM"); 
	СС.Вставить("NMot","1000ENNU");
	СС.Вставить("NBoi","1000BONU");
	СС.Вставить("vin","1000MVIN");
	СС.Вставить("typeMot","1000ENTY");
	СС.Вставить("typeBoi","1000BOTY");
	СС.Вставить("dateLiv","1000DDEL");
	СС.Вставить("dateTcmFab","1000DMAN");
	СС.Вставить("indBoi","1000INBOT");
	СС.Вставить("indMot","1000INEN");
	СС.Вставить("libCarrosserie","1000DESC");
	СС.Вставить("libConst","1000MMAN");
	СС.Вставить("libModel","1000MODE");
	СС.Вставить("marqCom","1000MMAR");
	

	
	СС.Вставить("1000TAPV","TAPV"); 
	СС.Вставить("1000TVV","TVV");
	СС.Вставить("1000VVER","Версия");
	СС.Вставить("1000DDEL","Дата отгрузки");
	СС.Вставить("1000DMAN","Дата производства");
	СС.Вставить("1000MMAN","Завод-изготовитель");
	СС.Вставить("1000MNUM","Заводской  номер");
	СС.Вставить("1000INEN","Индекс двигателя");
	СС.Вставить("1000INBOT","Индекс КПП"); 
	СС.Вставить("1000ENNOM","Номенклатура двигателя");
	СС.Вставить("1000BOTNOM","Номенклатура КПП"); 
	СС.Вставить("1000MMAR","Марка");
	СС.Вставить("1000MODE","Модель");
	СС.Вставить("1000NOEN","Номенклатура");
	СС.Вставить("1000ENNU","Номер двигателя");
	СС.Вставить("1000BONU","Номер КПП");
	СС.Вставить("1000DESC","Описание");
	СС.Вставить("1000MVIN","Оригинальный VIN");
	СС.Вставить("1000ENTY","Тип двигателя");
	СС.Вставить("1000BOTY","Тип КПП");
	СС.Вставить("8","Код модели");
	СС.Вставить("008","Код модели");
	СС.Вставить("999","Код двигателя");
	СС.Вставить("019","Вид топлива");
	СС.Вставить("19","Вид топлива");
	СС.Вставить("36","Привод");
	СС.Вставить("036","Привод");
	СС.Вставить("901","Фаза модели");
	СС.Вставить("301","Настройка подвески");
	СС.Вставить("011","Разрешенная масса");
	СС.Вставить("046","Кондиционер");
	СС.Вставить("038","Рулевое управление");
	СС.Вставить("042","ABS");
	СС.Вставить("713","Доп. оборудование");

	ОбщаяТаблица = Результат.Скопировать();
	
	Для Каждого Стр Из ОбщаяТаблица Цикл
		
		Если ЗначениеЗаполнено(Стр.Критерий) И СокрЛП(Стр.КодЭлементаКритерия) = "BASE" Тогда
			
			НовСтр = ТаблицаПоказателей.Добавить();
			НовСтр.Критерий = Стр.Критерий;
			НовСтр.ЗначениеКритерия = Стр.ЗначениеКритерия;
			
			КодОбъекта = СС.Получить(Стр.КодКритерия);
			Если КодОбъекта <> Неопределено Тогда
				НовСтр.КодОбъекта = КодОбъекта;
			КонецЕсли;
			
		ИначеЕсли СокрЛП(Стр.КодЭлементаКритерия) <> "BASE" И НЕ ЗначениеЗаполнено(Стр.Критерий) Тогда
			
			НовСтр = ТаблицаОпций.Добавить();
			НовСтр.КодОбъекта = Стр.КодОбъектаКритерия;
			НовСтр.КодКритерия = Стр.КодКритерия;
			НовСтр.ЗначениеКритерия = Стр.ЗначениеКритерия;
			
			Критерий = СС.Получить(Стр.КодОбъектаКритерия);
			Если Критерий <> Неопределено Тогда
				НовСтр.Критерий = Критерий;
				
				//Перемещаем первый символ артикула модели в конец.
				Если НовСтр.КодОбъекта = "8" ИЛИ НовСтр.КодОбъекта = "008" Тогда
					//НовСтр.КодКритерия = СРЕД(НовСтр.КодКритерия,2,СтрДлина(НовСтр.КодКритерия)-1) + ЛЕВ(НовСтр.КодКритерия,1);	
					Если Справочники.Модели.НайтиПоРеквизиту("Артикул",НовСтр.КодКритерия).Пустая() Тогда
						НовыйКодКритерия = 	СРЕД(НовСтр.КодКритерия,2,СтрДлина(НовСтр.КодКритерия)-1) + ЛЕВ(НовСтр.КодКритерия,1);
						Если НЕ Справочники.Модели.НайтиПоРеквизиту("Артикул",НовыйКодКритерия).Пустая() Тогда
							НовСтр.КодКритерия = НовыйКодКритерия;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;		
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ОбновитьИнформациюПоАвтомобилюИзBVM(Автомобиль) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Автомобиль) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТаблицаПоказателей) ИЛИ Не ЗначениеЗаполнено(ТаблицаОпций) Тогда
				
		Возврат Ложь;
		
	КонецЕсли;
	
	КодTAPV = ТаблицаПоказателей.Найти("TAPV", "Критерий").ЗначениеКритерия; 
	
	Если ЗначениеЗаполнено(КодTAPV) Тогда
		
		СпрTAPV = Справочники.Renault_СемействаАвтомобилей.НайтиПоКоду(КодTAPV);
		
		Если НЕ ЗначениеЗаполнено(СпрTAPV) Тогда
			
			НовЭлемент = Справочники.Renault_СемействаАвтомобилей.СоздатьЭлемент();
			НовЭлемент.Код = КодTAPV;
			//	НовЭлемент.Наименование = КодTAPV;
			НовЭлемент.Записать();
			
			СпрTAPV = НовЭлемент.Ссылка;
			
		КонецЕсли;
		
		TAPV = СпрTAPV;
		
	КонецЕсли;
	
	КодМоделиДвигателя = ТаблицаПоказателей.Найти("Тип двигателя", "Критерий").ЗначениеКритерия;
	
	Попытка
	
		ИндексМоделиДвигателя = ТаблицаПоказателей.Найти("Индекс двигателя", "Критерий").ЗначениеКритерия;
		
	Исключение
		
		ИндексМоделиДвигателя = "";
		
	КонецПопытки;
	
	
	КодМоделиКПП = ТаблицаПоказателей.Найти("Тип КПП", "Критерий").ЗначениеКритерия;
	
	Попытка
	
		ИндексМоделиКПП = ТаблицаПоказателей.Найти("Индекс КПП", "Критерий").ЗначениеКритерия;
		
	Исключение
		
		ИндексМоделиКПП = "";
		
	КонецПопытки;
		
	КодТипаКузова = ТаблицаОпций.Найти("008", "КодОбъекта").КодКритерия;
	ФазаСтрока = ТаблицаОпций.Найти("901", "КодОбъекта");
	
	Если ЗначениеЗаполнено(ФазаСтрока) Тогда
		
		Фаза = ФазаСтрока.КодКритерия;
		
	Иначе
		
		Фаза = "";
		
	КонецЕсли;
	
	КритерийТипаТоплива = ТаблицаОпций.Найти("019", "КодОбъекта").КодКритерия;
	
	Если СокрЛП(КритерийТипаТоплива) = "ESS" Тогда
		
		ТипТоплива = "Бензин";
		
	ИначеЕсли СокрЛП(КритерийТипаТоплива) = "DIESEL" Тогда
		
		ТипТоплива = "Дизель";
		
	ИначеЕсли СокрЛП(КритерийТипаТоплива) = "ELEC" Тогда
		
		ТипТоплива = "Электро"; 
		
	Иначе
		
		ТипТоплива = "";
		
	КонецЕсли;
	
	ABS = ЗначениеЗаполнено(ТаблицаОпций.Найти("042", "КодОбъекта"));
	
	КритерийТипаПриводаСтрока = ТаблицаОпций.Найти("036", "КодОбъекта");
	
	Если ЗначениеЗаполнено(КритерийТипаПриводаСтрока) Тогда
	
		КритерийТипапривода = КритерийТипаПриводаСтрока.КодКритерия;
		
	Иначе
		
		КритерийТипапривода = "";
		
	КонецЕсли;
	
	Если СокрЛП(КритерийТипапривода) = "TRPROP" Тогда
		
		ТипПривода = Перечисления.Renault_ПриводАвтомобиля.Задний;
		
	ИначеЕсли СокрЛП(КритерийТипапривода) = "TR4X2" Тогда
		
		ТипПривода = Перечисления.Renault_ПриводАвтомобиля.Передний;
		
	ИначеЕсли СокрЛП(КритерийТипапривода) = "TR4X4" Тогда
		
		ТипПривода = Перечисления.Renault_ПриводАвтомобиля.Полный; 
		
	Иначе
		
		ТипПривода = Перечисления.Renault_ПриводАвтомобиля.Передний;
		
	КонецЕсли; 
	
	Гур = ЗначениеЗаполнено(ТаблицаОпций.Найти("038", "КодОбъекта"));
	
	ФазаСсылка = Справочники.Renault_ФазыМоделей.НайтиСоздатьДанныеПоФазе(Автомобиль.Модель, Фаза);
	
	//Кондиционер?
	КритерийAC = ТаблицаОпций.Найти("046", "КодОбъекта");
	КодКлиматическойУстановки = "";
	
	Если НЕ ЗначениеЗаполнено(КритерийAC) Тогда 
		
		AC = Ложь;
		
	Иначе
		
		КодКлиматическойУстановки = СокрЛП(КритерийAC.КодКритерия);
		
		Если КодКлиматическойУстановки = "CHOREC" Тогда
			
			AC = Ложь;
			
		Иначе
			
			AC = Истина;			
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если AC = Истина Тогда
		
		СФ = Истина;
		
	Иначе
		
		СФ = ЗначениеЗаполнено(ТаблицаОпций.Найти("412", "КодОбъекта"));
		
	КонецЕсли;
	
	Запись = РегистрыСведений.Renault_АвтомобилиДопРеквизиты.СоздатьМенеджерЗаписи();
	Запись.Автомобиль = Автомобиль;
	Запись.Прочитать();
	
	Если НЕ Запись.Выбран() Тогда
		
		Запись.Автомобиль = Автомобиль;
		
	КонецЕсли;
	
	Запись.КодМоделиДвигателя = КодМоделиДвигателя;
	Запись.AC = AC;
	Запись.СалонныйФильтр = СФ;
	Запись.КодКлиматическойУстановки = КодКлиматическойУстановки;
	Запись.ABS = ABS;
	Запись.ГУР = Гур;
	Запись.ТипТоплива = ТипТоплива;
	Запись.ТипПривода = ТипПривода;
	Запись.ТипДвигателя = КодМоделиДвигателя;
	Запись.ИндексМоделиДвигателя = ИндексМоделиДвигателя;
	Запись.ИндексМоделиКПП = ИндексМоделиКПП; 
	Запись.КодМоделиКПП = КодМоделиКПП;
	Запись.Фаза = ФазаСсылка;
	Запись.КодТипаКузова = КодТипаКузова;
	Запись.СемействоАвтомобиля = TAPV;
	
	Запись.Записать();
	
	РегистрыСведений.Renault_КритерииАвтомобиля.ЗаполнитьКритерии(Автомобиль, ТаблицаОпций);
	РегистрыСведений.Renault_КритерииАвтомобиля.ЗаполнитьКритерии(Автомобиль, ТаблицаПоказателей, Истина);
	
КонецФункции
